{
  "TOOLBAR": {
    "NAVIGATION": {
      "MAIN_PAGE": "Main",
      "PROJECT": "Projects",
      "SKILLS": "Skills",
      "ABOUT": "About",
      "CONTACT": "Contact",
      "BACK": "Back"
    },
    "LANGS": {
      "EN": "English",
      "PL": "Polski",
      "UA": "Українська"
    }
  },
  "HOME_PAGE": {
    "HOME_BANNER": {
      "HELLO": "Hello,",
      "IM": "I am"
    },
    "HOME_ABOUT": {
      "TITLE": "A few words about me",
      "DESCRIPTION": "Hi there! My name is Vlad and I work as a fullstack web developer. I have 1.5 years of experience in this field and I absolutely love it. I have knowledge in Vue, Vuetify, Nest, Express, and Node etc., and I'm always eager to learn new technologies. I also enjoy traveling and exploring new places. In my free time, I hit the gym because I love staying active. Building web applications is not just a job for me - it's a way to express my creativity and passion."
    },
    "HOME_PROJECTS": {
      "TITLE": "Projects",
      "SUBTITLE": "Below you will find some of my works with a short description. If you want to see more - just click"
    },
    "HOME_SKILLS": {
      "SKILLS_TITLE": "Skills",
      "WORK_TITLE": "Work"
    }
  },
  "HOME_CONTACT": {
    "TITLE": "Let's stay in touch!",
    "SUBTITLE": "Yo! If you want to ask me something, or you want to invite me somewhere, or you have a business deal - just text me! If you want to eat some pizza with me, also send me a message!"
  },
  "FORM": {
    "LABEL": {
      "NAME": "Name",
      "EMAIL": "E-mail",
      "MESSAGE": "Message",
      "FILE": "Add file",
      "TERMS_CHECKBOX": "I agree to site ",
      "TERMS": "terms"
    },
    "PLACEHOLDER": {
      "NAME": "Joe",
      "MESSAGE": "Write something interesting here ..."
    },
    "SEND_BUTTON": "Send",
    "RULES": {
      "NAME": "Name is required",
      "EMAIL": "Valid email address required",
      "MESSAGE": "Message is required"
    }
  },
  "POLICY": {
    "TITLE": "Privacy policy",
    "DESCRIPTION":  "This Privacy Policy explains how personal data is collected, used, and protected by the portfolio website [name].",
    "PKTS": {
      "TITLE_1": "1. Data Collection",
      "DESCRIPTION_1": "The website collects only the personal data provided voluntarily by the user through the contact form. This includes the user's name, email address, message, and optional file attachment. The website does not collect any other personal data or information.<br><br>",
      "TITLE_2": "2. Data Usage",
      "DESCRIPTION_2": "The collected personal data is used solely for the purpose of responding to the user's inquiry or request. The website does not share, sell, or distribute any personal data to third parties. The website does not use personal data for marketing or advertising purposes.<br><br>",
      "TITLE_3": "3. Data Retention",
      "DESCRIPTION_3": "Personal data processed through the contact form will be stored for the period necessary to respond to the user's inquiry or request, as well as for any further contact related to that inquiry. After this time, the data will be deleted.<br><br>",
      "TITLE_4": "4. Recipients of personal data",
      "DESCRIPTION_4": "Personal data of users of the portfolio website are not disclosed to any other entities, except where required by law.<br><br>",
      "TITLE_5": "5. Cookies and Other Technologies",
      "DESCRIPTION_5": "The portfolio website does not use cookies or other tracking technologies. It only stores the locale value in localStorage to remember the user's selected language. This information is used solely to display the website in the selected language and is not shared with any other parties. Users can delete this value from localStorage at any time by setting the language to default or by clearing the localStorage completely.<br><br>"
    }
  },
  "WORKING_HISTORY": {
    "SHUMEE": {
      "DATE": "March 2021 - September 2021",
      "DESCRIPTION": {
        "1": "Analysis of foreign markets and business.",
        "2": "Listing offers and checking the correctness of the issued products from the technical and final side",
        "3": "Setting up price lists and margins"
      }
    },
    "TUTORE_HELPDESK": {
      "DATE": "October 2021 - December 2021",
      "DESCRIPTION": {
        "1": "Telephone support for problems installing or downloading applications, entering classes, etc.",
        "2": "Offering company services"
      }
    },
    "TUTORE_IT": {
      "DATE": "Junuary 2022 - Present",
      "DESCRIPTION": {
        "1": "Front programming (Vue, Vuex, Vuetify, JavaScript/TypeScript)",
        "2": "Backend programming, creating endpoints (Node, NestJS, Knex, Express)",
        "3": "Creating queries in MySQL",
        "4": "Implementation and operation of CMS systems (Strapi, Sanity)",
        "5": "Implementation and support of external integrations (SendGrid, SerwerSMS, Salesmanago, Hubspot, Wordwall)",
        "6": "Creating and recording bugs using the Jira system",
        "7": "API testing with Postman",
        "8": "Preparing the environment for manual tests",
        "9": "Help in creating e2e tests (Cypress)"
      }
    }
  },
  "PROJECTS": {
    "WHAT_USED": "Main technologies used",
    "SOURCE_CODE_AVAILABLE": "Source code",
    "SOURCE_CODE_UNAVAILABLE": "Source code not available"
  }
}