{
  "TOOLBAR": {
    "NAVIGATION": {
      "MAIN_PAGE": "Strona główna",
      "PROJECT": "Projekty",
      "SKILLS": "Umiejętności",
      "ABOUT": "O mnie",
      "CONTACT": "Kontakt",
      "BACK": "Wróć"
    },
    "LANGS": {
      "EN": "English",
      "PL": "Polski",
      "UA": "Українська"
    }
  },
  "HOME_PAGE": {
    "HOME_BANNER": {
      "HELLO": "Cześć",
      "IM": "Jestem"
    },
    "HOME_PROJECTS": {
      "TITLE": "Projekty",
      "SUBTITLE": "Poniżej znajdziesz moje roboty wraz z krótkim opisem. Jeżeli chcesz zobaczyć więcej - to klikaj"
    },
    "HOME_SKILLS": {
      "SKILLS_TITLE": "Umiejętności",
      "WORK_TITLE": "Doświadczenie"
    }
  },
  "HOME_CONTACT": {
    "TITLE": "Zostańmy w kontakcie!",
    "SUBTITLE": "Siema! Jeśli chcesz mnie o coś zapytać, chcesz mnie gdzieś zaprosić, albo masz biznesową propozycję - po prostu napisz do mnie! Jeśli chcesz zjeść ze mną pizzę, również wyślij mi wiadomość!"
  },
  "FORM": {
    "LABEL": {
      "NAME": "Imię",
      "EMAIL": "E-mail",
      "MESSAGE": "Wiadomość",
      "FILE": "Dodaj plik",
      "TERMS_CHECKBOX": "Wyrażam zgodę na",
      "TERMS": "politykę strony"
    },
    "PLACEHOLDER": {
      "NAME": "Jan",
      "MESSAGE": "Napisz coś ciekawego tutaj ..."
    },
    "SEND_BUTTON": "Wyślij",
    "RULES": {
      "NAME": "Imię jest wymagane",
      "EMAIL": "Poprawny adres e-mail jest wymagany",
      "MESSAGE": "Wiadomośc jest wymagana"
    }
  },
  "POLICY": {
    "TITLE": "Polityka prywatności",
    "DESCRIPTION":  "Niniejsza polityka prywatności określa zasady przetwarzania i ochrony danych osobowych przekazywanych przez użytkowników za pośrednictwem formularza kontaktowego na stronie portfolio [nazwa].",
    "PKTS": {
      "TITLE_1": "1. Rodzaje przetwarzanych danych osobowych oraz cel ich przetwarzania",
      "DESCRIPTION_1": "W ramach formularza kontaktowego przetwarzane są następujące dane osobowe:<br><br>• imię i nazwisko,<br>• adres e-mail,<br>• treść wiadomości,<br>• plik (opcjonalnie).<br><br>Dane te są przetwarzane w celu umożliwienia kontaktu z użytkownikami strony portfolio w odpowiedzi na ich pytania i prośby. W przypadku przesyłania pliku, dane te są przetwarzane w celu umożliwienia przekazania użytkownikom pliku.<br><br>",
      "TITLE_2": "2. Podstawa prawna przetwarzania danych osobowych",
      "DESCRIPTION_2": "Podstawą prawną przetwarzania danych osobowych jest art. 6 ust. 1 lit. f RODO, czyli prawnie uzasadniony interes administratora, którym jest udzielanie odpowiedzi na pytania i prośby użytkowników strony portfolio.<br><br>",
      "TITLE_3": "3. Okres przetwarzania danych osobowych",
      "DESCRIPTION_3": "Dane osobowe przetwarzane w ramach formularza kontaktowego będą przechowywane przez okres niezbędny do udzielenia odpowiedzi na pytanie lub prośbę użytkownika, a także do ewentualnego późniejszego kontaktu w związku z danym zapytaniem. Po tym czasie dane zostaną usunięte.<br><br>",
      "TITLE_4": "4. Odbiorcy danych osobowych",
      "DESCRIPTION_4": "Dane osobowe użytkowników strony portfolio nie są udostępniane żadnym innym podmiotom, z wyjątkiem sytuacji, gdy jest to wymagane przez przepisy prawa.<br><br>",
      "TITLE_5": "5. Pliki cookie i inne technologie",
      "DESCRIPTION_5": "Strona portfolio nie wykorzystuje plików cookie ani innych technologii śledzących. Jedynie przechowuje wartość locale w localStorage w celu zapamiętania wybranego przez użytkownika języka strony. Ta informacja jest wykorzystywana wyłącznie do poprawnego wyświetlania strony w wybranym języku i nie jest udostępniana innym podmiotom. Użytkownicy strony mogą w każdej chwili usunąć tę wartość z localStorage poprzez ustawienie języka na domyślny lub wyczyść localStorage całkowicie.<br><br>"
    }
  } 
}