{
  "TOOLBAR": {
    "NAVIGATION": {
      "MAIN_PAGE": "Головна сторінка",
      "PROJECT": "Проекти",
      "SKILLS": "Навички",
      "ABOUT": "Про мене",
      "CONTACT": "Контакт",
      "BACK": "Назад"
    },
    "LANGS": {
      "EN": "English",
      "PL": "Polski",
      "UA": "Українська"
    }
  },
  "HOME_PAGE": {
    "HOME_BANNER": {
      "HELLO": "Привіт",
      "IM": "Я - "
    },
    "HOME_PROJECTS": {
      "TITLE": "Проекти",
      "SUBTITLE": "Нижче знайдеш кілька моїх робіт я коротким описом. Якщо хочеш побачити більше - просто клікай"
    },
    "HOME_SKILLS": {
      "SKILLS_TITLE": "Навички",
      "WORK_TITLE": "Досвід"
    }
  },
  "HOME_CONTACT": {
    "TITLE": "Будемо в контакті!",
    "SUBTITLE": "Йоу! Якщо ти хочеш мене щось запитати, або кудись мене запросити, або у тебе є бізнес пропозиція - просто напиши мені! Якщо ти хочеш поїсти піци зі мною, також надішли мені повідомлення!"
  },
  "FORM": {
    "LABEL": {
      "NAME": "Ім'я",
      "EMAIL": "E-mail",
      "MESSAGE": "Повідомлення",
      "FILE": "Додай файл",
      "TERMS_CHECKBOX": "Погоджуюся на",
      "TERMS": "політику сторінки"
    },
    "PLACEHOLDER": {
      "NAME": "Данило",
      "MESSAGE": "Напиши тут щось цікаве ..."
    },
    "SEND_BUTTON": "Вислати",
    "RULES": {
      "NAME": "Необхідно вписати ім'я",
      "EMAIL": "Необхідно вписати правильний адрес e-mail",
      "MESSAGE": "Необхідно написати повідомлення"
    }
  },
  "POLICY": {
    "TITLE": "Політика приватності",
    "DESCRIPTION":  "Ця політика конфіденційності визначає принципи обробки та захисту персональних даних, які надсилаються користувачами через форму зворотного зв'язку на сайті портфоліо[name].",
    "PKTS": {
      "TITLE_1": "1. Різновиди персональних даних та ціль їх обробки",
      "DESCRIPTION_1": "В рамках форми зв'язку обробляються наступні персональні дані:<br><br>• ім'я та прізвище,<br>• електронна адреса,<br>• текст повідомлення,<br>• файл (за бажанням).<br><br>Ці дані обробляються з метою забезпечення зв'язку з користувачами портфоліо-сайту, відповіді на їхні запитання та прохання. У разі передачі файлу ці дані обробляються з метою передачі файлу користувачам.<br><br>",
      "TITLE_2": "2. Правова підстава обробки персональних даних",
      "DESCRIPTION_2": "Правовою підставою обробки персональних даних є стаття 6(1)(f) Загального регламенту про захист персональних даних, тобто законний інтерес адміністратора у відповіді на запитання та прохання користувачів портфоліо-сайту.<br><br>",
      "TITLE_3": "3. Термін зберігання персональних даних",
      "DESCRIPTION_3": "Персональні дані, які обробляються в рамках форми зв'язку, будуть зберігатися протягом періоду, необхідного для відповіді на запитання або прохання користувача, а також для подальшого зв'язку щодо цього запитання. Після цього часу дані будуть видалені.<br><br>",
      "TITLE_4": "4. Одержувачі персональних даних",
      "DESCRIPTION_4": "Персональні дані користувачів портфоліо-сайту не передаються жодним іншим сторонам, за винятком випадків, коли цього вимагають законодавчі вимоги.<br><br>",
      "TITLE_5": "5. Файли cookie та інші технології",
      "DESCRIPTION_5": "Сторінка портфоліо не використовує файли cookie та інші технології для відстеження користувачів. Єдине, що зберігається - це значення locale в localStorage для запам'ятовування мови, обраної користувачем. Ця інформація використовується тільки для правильного відображення сторінки в обраній мові та не надається іншим суб'єктам. Користувачі сторінки можуть в будь-який момент видалити це значення з localStorage, встановивши мову за замовчуванням або повністю очистивши localStorage.<br><br>"
    }
  },
  "WORKING_HISTORY": {
    "SHUMEE": {
      "DATE": "Березень 2021 - Вересень 2021",
      "DESCRIPTION": {
        "1": "Аналіз закордонних ринків",
        "2": "Додавання продуктів та перевірка правильності оформленої продукції з технічної та остаточної сторони",
        "3": "Встановлення цінників і марж"
      }
    },
    "TUTORE_HELPDESK": {
      "DATE": "Жовтень 2021 - Грудень 2021",
      "DESCRIPTION": {
        "1": "Підтримка по телефону при проблемах із встановленням або завантаженням додатків, записом на заняття тощо.",
        "2": "Надання послуг компанії"
      }
    },
    "TUTORE_IT": {
      "DATE": "Січень 2022 - До тепер",
      "DESCRIPTION": {
        "1": "Програмування frontendu (Vue, Vuex, Vuetify, JavaScript/TypeScript)",
        "2": "Програмування backendu, tworzenie endpointów (Node, NestJS, Knex, Express)",
        "3": "Написання запитань до бази даних MySQL",
        "4": "Впровадження та експлуатація системів CMS (Strapi, Sanity)",
        "5": "Впровадження та підтримка зовнішніх інтеграцій (SendGrid, SerwerSMS, Salesmanago, Hubspot, Wordwall)",
        "6": "Створення та запис помилок за допомогою системи Jira",
        "7": "Тестування API за допомогою Postman",
        "8": "Підготовка середовища для ручних тестів",
        "9": "Допомога у створенні тестів e2e (Cypress)"
      }
    }
  }
}