{
  "TOOLBAR": {
    "NAVIGATION": {
      "MAIN_PAGE": "Головна сторінка",
      "PROJECT": "Проекти",
      "SKILLS": "Навички",
      "ABOUT": "Про мене",
      "CONTACT": "Контакт",
      "BACK": "Назад"
    },
    "LANGS": {
      "EN": "English",
      "PL": "Polski",
      "UA": "Українська"
    }
  },
  "HOME_PAGE": {
    "HOME_BANNER": {
      "HELLO": "Привіт,",
      "IM": "Я -"
    },
    "HOME_ABOUT": {
      "TITLE": "Кілька слів про мене",
      "DESCRIPTION": "Привіт! Мене звуть Влад і я працюю fullstack веб-розробником. У цій сфері у мене 1,5 року досвіду. Я маю знання в галузі Vue, Vuetify, Nest, Express, Node та інші, і завжди готовий вивчати нові технології. Мені подобається подорожувати і відкривати нові місця. У вільний час я відвідую спортзал, бо люблю бути активним. Створення веб-додатків для мене - це не просто робота, але й спосіб виразити свою креативність і пристрасть."
    },
    "HOME_PROJECTS": {
      "TITLE": "Проекти",
      "SUBTITLE": "Нижче знайдеш кілька моїх робіт з коротким описом. Якщо хочеш побачити більше - клікай нижче"
    },
    "HOME_SKILLS": {
      "SKILLS_TITLE": "Навички",
      "WORK_TITLE": "Досвід"
    }
  },
  "HOME_CONTACT": {
    "TITLE": "Будемо в контакті!",
    "SUBTITLE": "Йоу! Якщо ти хочеш мене щось запитати, або кудись мене запросити, або у тебе є бізнес пропозиція - просто напиши мені! Якщо ти хочеш поїсти піци зі мною, також надішли мені повідомлення!"
  },
  "FORM": {
    "LABEL": {
      "NAME": "Ім'я",
      "EMAIL": "E-mail",
      "MESSAGE": "Повідомлення",
      "FILE": "Додай файл pdf",
      "TERMS_CHECKBOX": "Погоджуюся на",
      "TERMS": "політику приватності"
    },
    "PLACEHOLDER": {
      "NAME": "Данило",
      "MESSAGE": "Напиши тут щось цікаве ..."
    },
    "SEND_BUTTON": "Вислати",
    "RULES": {
      "NAME": "Необхідно вписати ім'я",
      "EMAIL": "Необхідно вписати правильний адрес e-mail",
      "MESSAGE": "Необхідно написати повідомлення"
    }
  },
  "POLICY": {
    "TITLE": "Політика приватності",
    "DESCRIPTION":  "Ця політика конфіденційності визначає принципи обробки та захисту персональних даних, які надсилаються користувачами через форму зворотного зв'язку на сайті портфоліо[name].",
    "PKTS": {
      "TITLE_1": "1. Різновиди персональних даних та ціль їх обробки",
      "DESCRIPTION_1": "В рамках форми зв'язку обробляються наступні персональні дані:<br><br>• ім'я та прізвище,<br>• електронна адреса,<br>• текст повідомлення,<br>• файл (за бажанням).<br><br>Ці дані обробляються з метою забезпечення зв'язку з користувачами портфоліо-сайту, відповіді на їхні запитання та прохання. У разі передачі файлу ці дані обробляються з метою передачі файлу користувачам.<br><br>",
      "TITLE_2": "2. Правова підстава обробки персональних даних",
      "DESCRIPTION_2": "Правовою підставою обробки персональних даних є стаття 6(1)(f) Загального регламенту про захист персональних даних, тобто законний інтерес адміністратора у відповіді на запитання та прохання користувачів портфоліо-сайту.<br><br>",
      "TITLE_3": "3. Термін зберігання персональних даних",
      "DESCRIPTION_3": "Персональні дані, які обробляються в рамках форми зв'язку, будуть зберігатися протягом періоду, необхідного для відповіді на запитання або прохання користувача, а також для подальшого зв'язку щодо цього запитання. Після цього часу дані будуть видалені.<br><br>",
      "TITLE_4": "4. Одержувачі персональних даних",
      "DESCRIPTION_4": "Персональні дані користувачів портфоліо-сайту не передаються жодним іншим сторонам, за винятком випадків, коли цього вимагають законодавчі вимоги.<br><br>",
      "TITLE_5": "5. Файли cookie та інші технології",
      "DESCRIPTION_5": "Сторінка портфоліо не використовує файли cookie та інші технології для відстеження користувачів. Єдине, що зберігається - це значення locale в localStorage для запам'ятовування мови, обраної користувачем. Ця інформація використовується тільки для правильного відображення сторінки в обраній мові та не надається іншим суб'єктам. Користувачі сторінки можуть в будь-який момент видалити це значення з localStorage, встановивши мову за замовчуванням або повністю очистивши localStorage.<br><br>"
    }
  },
  "WORKING_HISTORY": {
    "SHUMEE": {
      "DATE": "Березень 2021 - Вересень 2021",
      "DESCRIPTION": {
        "1": "Аналіз закордонних ринків",
        "2": "Додавання продуктів та перевірка правильності оформленої продукції з технічної та остаточної сторони",
        "3": "Встановлення цінників і марж"
      }
    },
    "TUTORE_HELPDESK": {
      "DATE": "Жовтень 2021 - Грудень 2021",
      "DESCRIPTION": {
        "1": "Підтримка по телефону при проблемах із встановленням або завантаженням додатків, записом на заняття тощо.",
        "2": "Надання послуг компанії"
      }
    },
    "TUTORE_IT": {
      "DATE": "Січень 2022 - До тепер",
      "DESCRIPTION": {
        "1": "Програмування frontend (Vue, Vuex, Vuetify, JavaScript/TypeScript)",
        "2": "Програмування backend (Node, NestJS, Knex, Express)",
        "3": "Написання запитань до бази даних MySQL",
        "4": "Впровадження та експлуатація системів CMS (Strapi, Sanity)",
        "5": "Впровадження та підтримка зовнішніх інтеграцій (SendGrid, SerwerSMS, Salesmanago, Hubspot, Wordwall)",
        "6": "Створення та запис помилок за допомогою системи Jira",
        "7": "Тестування API за допомогою Postman",
        "8": "Підготовка середовища для ручних тестів",
        "9": "Допомога у створенні тестів e2e (Cypress)"
      }
    }
  },
  "PROJECTS": {
    "WHAT_USED": "Основні технології, які використовувались у проекті",
    "SOURCE_CODE_AVAILABLE": "Доступний код",
    "SOURCE_CODE_UNAVAILABLE": "Код недоступний",
    "TECHNOLOGIES_DESCRIPTION": {
      "VUE": "був використаний як основний фреймворк фронтенду для створення реактивності та інтерфейсу користувача.",
      "VUEX": "використаний для управління станом додатку. В сторі книги завантажуються з зовнішнього API і потім відображаються на сторінці. Також у сторі знаходиться кошик, в якому зберігаються книги, які користувач додав до кошика та інші дані.",
      "VUETIFY": "це бібліотека компонентів Material Design для Vue.js. Вона була обрана через свою велику кількість готових компонентів, які можна використовувати в додатку. Це дозволило зробити розробку додатку швидшою та простішою.",
      "JAVASCRIPT": "використаний як основна мова програмування для логіки на фронтенді.",
      "CSS": "використаний як основна мова стилізації. У цьому проекті я використовував основні концепції CSS, такі як селектори, flexbox і т.д.",
      "SANITY": "використаний як система управління контентом (CMS). Вибір пав на нього через його високу сумісність з Vue.js та легкість використання. Також він має безкоштовний план, достатній для обслуговування веб-сайту.",
      "FIREBASE": "був використаний для хостингу. Firebase був обраний через його швидкість та ефективність. Будучи хмарним сервісом, він звільняє від необхідності власного сервера, що зменшує витрати на підтримку додатку.",
      "FIREBASE_AUTH": "використаний для аутентифікації користувачів на платформі (вхід/реєстрація/зміна пароля тощо).",
      "NUXT": "використовується як вторинний фреймворк на фронтенді. Був обраний з метою оптимізації для SEO, оскільки цей фреймворк рендерує додаток по стороні сервера.",
      "NEST": "використовується як основний фреймворк на бекенді.",
      "STRAPI": "використаний як CMS (Система управління контентом). Він був обраний через його відмінну сумісність з Vue.js, функціональність та простоту використання.", 
      "KNEX": "бібліотека використовується як основна для фреймворка NestJS.",
      "EXPRESS": "використовується як основний фреймворк на бекенді.",
      "MYSQL": "використаний як основна система керування базами даних.",
      "TYPESCRIPT": "використаний як основна мова програмування як на фронтенді, так і на бекенді. Вона була обрана, оскільки це мова зі статичною типізацією, що дозволяє швидше виявляти помилки.",
      "I18N": "використаний для перекладу сторінки на три мови: англійську, польську та українську.",
      "AOS": "бібліотека використана для анімації елементів на сторінці"
    },
    "K20_APARTMENTS": {
      "DESCRIPTION": "Веб-сайт K20 Апартаменти - служить для ознайомлення з пропозицією апартаментів та їх бронювання. Це комерційний проект, який я виконав самостійно від А до Я на замовлення проекту Apartamenty K20.\n\nВеб-сайт є повністю адаптивним, що означає, що він виглядає добре на будь-якому пристрої. Він також оптимізований з точки зору керування, оскільки підключений до CMS Sanity. Кожен елемент сайту можна змінити в панелі адміністратора Sanity, завдяки чому сайт дуже легко керувати і не вимагає технічних знань або присутності розробника при зміні вмісту. CMS була підключена з метою того, що зовнішній вигляд, опис та обладнання апартаментів можуть часто змінюватися, тому зміна або заміна вмісту повинна бути швидкою і простою.\n\nВеб-сайт також оптимізований з точки зору SEO, оскільки хостується на Firebase Hosting, який є швидким і ефективним. Також були підключені мета-теги, які необхідні для позиціонування сайту в пошуковій системі Google. Це комерційний проект, тому вихідний код не доступний публічно."
    },
    "TUTORE": {
      "DESCRIPTION": "Платформа для навчання Tutore. Має багато функціональностей, таких як: тести, уроки, словник, граматика, освітній бот і т.д.\n\nЦей проект був розроблений для компанії, в якій я працюю, Tutore Poland. Це спільний проект, який виконувався командою. Моя основна роль у цьому проекті на фронтенді полягала у створенні окремих підсторінок, вдосконаленні інтерфейсу користувача і додаванні адаптивності до сторінок, створених мною та моїми колегами. Я також підключав окремі компоненти до CMS Strapi та виконував інші завдання.\n\nНа бекенді моя основна роль включала створення ендпоінтів для конкретних вимог, модифікацію існуючих ендпоінтів, створення seeds для міграції бази даних, створення нових моделей, інтерфейсів, допоміжних функцій і т.д. Також моєю роллю було підключення зовнішніх інтеграцій, таких як Salesmanago (маркетинговий сервіс), Wordwall (сервіс з тестами для уроків), Sendgrid (сервіс електронної пошти), SerwerSMS (сервіс SMS-повідомлень). Цей проект постійно розвивається, тому постійно можуть з'являтися нові функції.\n\nЦя платформа призначена для навчання різних предметів, таких як математика, програмування, іноземні мови, малювання, гра на гітарі та багато інших. Учень має доступ до матеріалів, тестів, домашніх завдань на платформі, а також може відвідувати заняття, перевіряти свої досягнення та виконувати багато інших дій. Це комерційний проект, тому вихідний код не доступний публічно."
    },
    "TUTORE_PARTNERS": {
      "DESCRIPTION": "Партнерський веб-сайт Tutore. Це проект, який я виконав для компанії Tutore. Цей веб-сайт призначений для ознайомлення партнерів Tutore з тим, що вони можуть запропонувати та які переваги можуть отримати потенційні партнери. На веб-сайті є проста форма, яка підключена до Google-аркуша. Це комерційний проект, тому вихідний код не доступний публічно."
    },
    "CRM_TUTORE": {
      "DESCRIPTION": "Внутрішній CRM Tutore Poland. Сторінка призначена для керування клієнтами, уроками і т.д. Дозволяє записувати клієнтів на уроки, надсилати їм SMS-повідомлення та електронні листи. Також дозволяє керувати уроками та створювати нові.\n\nМоєю роллю було підтримувати проект та додавати нові функціональні можливості як на фронтенді, так і на бекенді. Проект є комерційним, тому вихідний код не доступний публічно."
    },
    "BOOKS_SHOP": {
      "DESCRIPTION": "Перший проект, який я виконав з використанням Vue.js. Це додаток, який дозволяє додавати книжки до кошика. Додаток дуже простий, але він дозволив мені ознайомитись з основними концепціями Vue.js, а також з основами CSS і JavaScript. Крім того, цей проект допоміг мені ознайомитись з основами RestAPI, оскільки книжки отримуються зовнішнім API за допомогою методу fetch().\n\nФункціональність дозволяє додавати книжки до кошика, видаляти та змінювати кількість товарів безпосередньо у кошику. На сторінці підсумку була додана валідація форми, captcha, а також за допомогою API банку був підключений конвертер з USD на PLN. Проект доступний публічно на GitHub."
    },
    "MY_PORTFOLIO": {
      "DESCRIPTION": "Портфоліо, яке ви бачите перед собою. Я створив цей веб-сайт, щоб продемонструвати свої навички та проекти. У цьому проекті моїм завданням було перевірити технологію i18n, яка дозволяє перекладати веб-сторінки. Сайт доступний на трьох мовах: англійській, польській та українській.\n\nПроект є публічно доступним на GitHub."
    }
  }
}